# ConnectionInputPoint Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectionInputPoint Members
ConnectionInputPoint Class Constructors Methods Properties See Also
---
The ConnectionInputPoint type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConnectionInputPoint()()()() | Construct a default input point. |
| ConnectionInputPoint(XYZ) | Construct an input point from 3d point. A new valid id will be auto-generated. |
| ConnectionInputPoint(XYZ, Guid) | Construct an input point from 3d point and id. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ConnectionInputPoint |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Id | Unique id of this input point. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Point | 3d position of this input point. |

# See Also
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace